In [19]:
import pandas as pd
import numpy as np

In [20]:
dados = [['Alameda Ernesto Augusto, 1753 - apto 5',0,0],['Travessa Cristo,849',5,6],['Rua do Whisky, 1292 - sala14',8,9]]
df = pd.DataFrame(dados,
                  index=['lin1','lin2','lin3'],
                  columns=['endereco','numero','complemento'],
                  dtype="string")

df = df.assign(numero=np.nan) 
df = df.assign(complemento=np.nan) 
df

                                    endereco  numero  complemento
lin1  Alameda Ernesto Augusto, 1753 - apto 5     NaN          NaN
lin2                     Travessa Cristo,849     NaN          NaN
lin3            Rua do Whisky, 1292 - sala14     NaN          NaN

In [21]:
type(df['complemento']['lin2'])

numpy.float64

In [22]:
df = df.astype('str')
type(df['complemento']['lin2'])

str

In [23]:
type(df['complemento']['lin1'])

str

In [24]:
df['complemento']['lin3']

'nan'

In [25]:
df

                                    endereco numero complemento
lin1  Alameda Ernesto Augusto, 1753 - apto 5    nan         nan
lin2                     Travessa Cristo,849    nan         nan
lin3            Rua do Whisky, 1292 - sala14    nan         nan

In [26]:
#1Âª forma
df['endereco']['lin1']

'Alameda Ernesto Augusto, 1753 - apto 5'

In [27]:
dividido = df['endereco']['lin1'].split(',')
dividido

['Alameda Ernesto Augusto', ' 1753 - apto 5']

In [28]:
df.at['lin1', 'endereco']= dividido[0]
df.at['lin1', 'numero']= dividido[1]


df

                          endereco          numero complemento
lin1       Alameda Ernesto Augusto   1753 - apto 5         nan
lin2           Travessa Cristo,849             nan         nan
lin3  Rua do Whisky, 1292 - sala14             nan         nan

In [29]:
dividido = df['numero']['lin1'].split('-')
dividido

[' 1753 ', ' apto 5']

In [30]:
df.at['lin1', 'numero']= dividido[0]
df.at['lin1', 'complemento']= dividido[1]


df

                          endereco  numero complemento
lin1       Alameda Ernesto Augusto   1753       apto 5
lin2           Travessa Cristo,849     nan         nan
lin3  Rua do Whisky, 1292 - sala14     nan         nan